{
  "main": {
    "name": "Jarred Taylor",
    "occupation": " Full Stack Software Engineer",
    "description": " currently employed by ",
    "employer": "freelance web developer",
    "jobDescription": "create various web applications for clients across multiple sectors",
    "image": "profile_pic.jpg",
    "bio": "Currently working as a Freelance Web Developer, I specialize in JavaScript & ReactJS. As I progress through my BASc in Applied Computing with an Artificial Intelligence emphasis, I am pivoting from Web Development to pursue a career as a Machine Learning Engineer. Regarding ML & Data Engineering, the technologies I am most versed in are Python, Java, and SQL.",
    "bioCont": "In November of 2023, I will be transitioning out of the United States Air Force, and in December, I will be obtaining my Bachelors of Applied Science. Upon my departure from the military, I plan to pursue a full-time Artificial Intelligence/Machine Learning Engineering role.",
    "bioExt": "In addition to my work & studies, I love fitness, traveling, reading, and I also have a new found passion for writing which you can read more about in my blog.",
    "contactmessage": "Do you have a project for me? Think I'd be a great fit for your team? I'd love to hear from you, contact me via email or by using the form below if you'd like to get in contact with me.",
    "email": "jarrede20@gmail.com",
    "phone": "(314) 398-3570",
    "address": {
      "street": "Pacific Avenue",
      "city": "Atlanta",
      "state": "GA",
      "zip": ""
    },
    "website": "http://www.jtaylor.app",
    "resumedownload": "https://drive.google.com/file/d/1bvOEDRBb9XFInFjWo2XClnjO3sd12wq_/view?usp=sharing",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/jarred-taylor-032065177/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "http://github.com/jtaylortech",
        "className": "fa fa-github"
      },
      {
        "name": "hashnode",
        "url": "https://taylortech.app/",
        "className": "fa fa-pencil"
      },
      {
        "name": "stack-overflow",
        "url": "https://stackoverflow.com/users/13253808/jtaylortech?tab=profile",
        "className": "fa fa-stack-overflow"
      },
      {
        "name": "instagram",
        "url": "http://instagram.com/jtaylor.io/",
        "className": "fa fa-instagram"
      },
      {
        "name": "twitter",
        "url": "https://twitter.com/JTaylorTech_",
        "className": "fa fa-twitter"
      }
    ]
  },
  "resume": {
    "skillmessage": "Beginning my journey as a web developer and now transitioning towards machine learning, I have organically become comfortable with various programming languages. Here are some of my favorites.",
    "education": [
      {
        "school":"University of Arizona - College of Applied Science & Technology",
        "degree":"Bachelor of Applied Science in Applied Computing: Emphasis in Artificial Intelligence",
        "graduated":"Expected Graduation of December 2023",
        "description":"Knowing that I have a passion for machine learning, data analytics, and artificial intelligence, I felt the need to seek out a program that would help me gain more of a foundational understanding of these topics and challenge me to create technical solutions. Studying this degree, I am learning to use computation and technology as a tool to solve problems and design and build computer-based systems and digital artifacts. The emphasis in Artificial Intelligence focuses on AI algorithm development and applying AI to approach practical application problems."
      },
      {
        "school": "Arizona State University - Ira A. Fulton Schools of Engineering",
        "degree": "Bachelor of Science in Software Engineering",
        "graduated": "May 2021 - December 2021",
        "description": "While pursuing this degree, I have expanded my previous knowledge in programming languages, how to build code, and software development. I am currently learning how to create complex programming solutions, create algorithms and data structures, as well as the foundations of cyber security concepts. With this degree path being as project centric as it is, I have completed various software engineering projects which helped me gain hands-on experience and develop teamwork skills in the software engineering community."
      },
      {
        "school": "Minnesota State University, Moorhead - Paseka School of Business",
        "degree": "Bachelor of Business Administration in International Business",
        "graduated": "August 2019 - May 2020",
        "description": "I had the privilege of attending this university by way of a Football Scholarship to pursue my BBA. Here, I studied International Business and gained the foundational learning of business, specifically in economics, marketing, and accounting. After a full year, and some deep self-reflection, I decided to hang up the cleats and enlist in the United States Air Force."
      }
    ],
    "work": [
      {
        "company": "Taylor Technologies, LLC",
        "title": "Freelance Machine Learning Engineer",
        "years": "February 2022 - Present",
        "description": "I offer a variety of services specializing in ML modeling & development, deployment & maintenance, as well as consulting. The main goal is to help companies leverage machine learning and data algorithms to add value to their business. My solutions include building your specific product step by step to ensure your company can enhance accuracy while eliminating errors and improving the customer experience."
      },
      {
        "company": "Taylor Technologies, LLC",
        "title": "Freelance Full-Stack Software Engineer",
        "years": "March 2020 - Present",
        "description": "I create web applications for various clients ranging from logistical companies, e-commerce platforms, tech startups, informative web pages, blogs, plus more. As a web developer, I specialize in JavaScript, ReactJS, HTML, & CSS."
      },
      {
        "company": "United States Air Force",
        "title": "Airborne Mission Systems Operator",
        "years": "Nov 2019 - Present",
        "description": "Responsible for operating the radar, communications, and electronic equipment. Contributing to the management of the battle space during tactical and strategic missions by coordinating all of the necessary data received on airborne command centers."
      }
    ],
    "skills": [
      {
        "name": "Python",
        "description": "Once I realized I wanted to shift from web development to machine learning, I began learning it and I have fallen more in love with it every step along the way.",
        "image": "python.png"
      },
      {
        "name": "ReactJs",
        "description": "After having an understanding of JS, I began to transition to learning ReactJS for web development projects.",
        "image": "react.png"
      },
      {
        "name": "MongoDB",
        "description": "The ease of use of MongoDB suits my needs the best in terms of databases and it has become beyond enjoyable to work with.",
        "image": "mongo.jpg"
      },
      {
        "name": "Java",
        "description": "Java was the first programming language that I learned in college. With nearly all of my courses requiring programing with Java, it is the language I am most familiar with in terms of data-structure and algorithm programming.",
        "image": "java.jpg"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Michael Angel's Transportation",
        "category": "Transportation company web app using ReactJS",
        "image": "matranspo.png",
        "url": "http://www.mikeangelstranspo.com"
      },
      {
        "title": "Chi Dynamic",
        "category": "Web app for a tech based start up",
        "image": "chidynamic.png",
        "url": "https://www.chidynamic.com/"
      },
      {
        "title": "Natous",
        "category": "Design heavy responsive mock web app for an outdoor touring company",
        "image": "nature.png",
        "url": "https://jtaylortech.github.io/nature-tours/"
      },
      {
        "title": "Bankist",
        "category": "Interactive mock web app for a banking company",
        "image": "bankist.png",
        "url": "https://jtaylortech.github.io/bank/"
      },
      {
        "title": "Numbers Game",
        "category": "Interactive number guessing game using JavaScript",
        "image": "numbers.png",
        "url": "https://jtaylortech.github.io/numbers-game/"
      },
      {
        "title": "Nexter Real Estate",
        "category": "Sleek mock web app for a real estate brokerage company",
        "image": "realestate.png",
        "url": "https://jtaylortech.github.io/realestate-company"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Jarred was an absolute pleasure to work with! His communication skills were amazing and he made sure he understood exactly what I was asking for before beginning the project. Throughout the process, the communication never slowed down which ended up with me receiving an amazing website prior to the agreed deadline. HIGHLY recommend.",
        "user": "Freelance Client, Michelle Wallace"
      },
      {
        "text":"I was looking for a way to move my online clothing store from just social media being housed on a website but I had no idea where to start. I told JT about what I was thinking and he handled it all from there. After providing 3 diverse templates for me to choose from, he immediately followed up with great work and letting me customize it along the way.",
        "user": "Client, Nathan Graham"
      }

    ]
  }
}